app/views/comments/create.json.jbuilder

json.text @comment.text
json.date    @comment.created_at.strftime("%Y/%m/%d %H:%M")
---
INSERT INTO `comments` (`user_id`, `post_id`, `text`, `created_at`, `updated_at`) VALUES (1, 3, 'ffff', '2020-03-07 14:50:37', '2020-03-07 14:50:37')