app/views/users/show.html.erb

SELECT COUNT(*) FROM `likes` WHERE `likes`.`post_id` = 1
---
              <h5 class="mt-0 mb-1 col-12"><%= post.title.truncate(10, omission: '...') %></h5>
              <div class="btn">いいね件数: <%= post.likes.count %></div>