app/views/posts/show.html.erb

<div class="show_btns row">
  <div class="btn">いいね件数: <%= @post.likes.count %></div>
---
SELECT COUNT(*) FROM `likes` WHERE `likes`.`post_id` = 1

<% end %>
  <div class="btn">友達登録: <%= @post.user.followers.count %></div>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `users` INNER JOIN `relationships` ON `users`.`id` = `relationships`.`user_id` WHERE `relationships`.`follow_id` = 1