app/controllers/comments_controller.rb

    def create
        @comment = Comment.new(comment_params)
        @post = Post.find(comment_params[:post_id])
        @comments = @post.comments.includes(:user)
        if @comment.save
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 3 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `comments` (`user_id`, `post_id`, `text`, `created_at`, `updated_at`) VALUES (1, 3, 'ssssss', '2020-03-07 14:44:30', '2020-03-07 14:44:30')