app/controllers/posts_controller.rb

INSERT INTO `posts` (`title`, `body`, `video`, `user_id`, `created_at`, `updated_at`) VALUES ('ukeru', 'wwwwwwwwwwwww', 'テスト.mp4', 1, '2020-03-06 12:51:22', '2020-03-06 12:51:22')
---
    def create
        @post = Post.new(post_params)
        if @post.save

SELECT `posts`.* FROM `posts` ORDER BY created_at DESC
---
    def index
        @posts = Post.all.order('created_at DESC')

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`post_id` = 1 ORDER BY created_at DESC
---
    def show
        @user = User.find(current_user.id)
        @comment = Comment.new()
        @comments = @post.comments.includes(:user)

DELETE FROM `posts` WHERE `posts`.`id` = 8
---
    def destroy
        redirect_to root_path, notice: '削除しました' if @post.destroy