app/controllers/relationships_controller.rb

  def create
    user = User.find(params[:follow_id])
    post = Post.find(params[:post_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1

  def destroy
    user = User.find(params[:follow_id])
    post = Post.find(params[:post_id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1