app/models/user.rb

  def already_liked?(post)
    self.likes.exists?(post_id: post.id)
---
SELECT  1 AS one FROM `likes` WHERE `likes`.`user_id` = 1 AND `likes`.`post_id` = 2 LIMIT 1

  def follow(other_user)
    unless self == other_user
      self.relationships.find_or_create_by(follow_id: other_user.id)
---
INSERT INTO `relationships` (`user_id`, `follow_id`, `created_at`, `updated_at`) VALUES (3, 1, '2020-03-07 09:37:34', '2020-03-07 09:37:34')
SELECT  `relationships`.* FROM `relationships` WHERE `relationships`.`user_id` = 3 AND `relationships`.`follow_id` = 1 LIMIT 1

  def unfollow(other_user)
    relationship = self.relationships.find_by(follow_id: other_user.id)
    relationship.destroy if relationship
---
SELECT  `relationships`.* FROM `relationships` WHERE `relationships`.`user_id` = 3 AND `relationships`.`follow_id` = 1 LIMIT 1
DELETE FROM `relationships` WHERE `relationships`.`id` = 1

  def following?(other_user)
    self.followings.include?(other_user)
---
SELECT  1 AS one FROM `users` INNER JOIN `relationships` ON `users`.`id` = `relationships`.`follow_id` WHERE `relationships`.`user_id` = 3 AND `users`.`id` = 1 LIMIT 1